<?php
/**************************************************************************************
 ***  文件：IndexAction.class.php
 ***  说明：后台管理首页显示类
 ***  日期：2012-08-12
 *************************************************************************************/

//IndexAction控制类继承统一入口加载类CommonAction
class IndexAction extends  CommonAction {

	/***************************************
     *** 函数名：index
     *** 参数：无
     *** 功能 ：后台管理首页的显示
	 ****************************************/
	function index(){

		$this->display();	
	}

    /***************************************
     *** 函数名：top
     *** 参数：无
     *** 功能 ：头部的显示
	 ****************************************/
	function top(){
		//print_r($_SESSION);
		//exit();
		$this->display();
	}

	/***************************************
     *** 函数名：menu
     *** 参数：无
     *** 功能 ：左边菜单栏显示
	 ****************************************/		
	function menu(){
		$this->display();
	}

	/***************************************
     *** 函数名：main
     *** 参数：无
     *** 功能 ：主管理框架的显示
	****************************************/
	function main(){
		$this->assign('timer',$this->getTime());
		$this->display();
	}		

	/***************************************
     *** 函数名：bottom
     *** 参数：无
     *** 功能 ：底部界面显示
	****************************************/
	function bottom(){   
		$this->assign('date',date('Y-m-d'));
		$this->display();
	}
		//
}
?>